# Пользователь вводит 2 набора чисел. Выведите на экран:
# 1. Числа, которые присутствуют в обоих наборах одновременно.
# 2. Числа из первого набора, которые отсутствуют во втором, и наоборот.
# 3. Числа из обоих наборов, за исключением чисел, найденных в пункте 1.
try:
    list_1 = [float(x) for x in input("Введите первый список(через пробел):").split()]
    list_2 = [float(x) for x in input("Введите второй список(через пробел):").split()]

    set_1 = set(list_1)
    set_2 = set(list_2)
    in_two = [x for x in set_1 if x in set_2]
    in_first = [x for x in list_1 if x not in set_2]
    in_second = [x for x in list_2 if x not in set_1]
    origin = in_first + in_second
    print(f"Числа, которые присутствуют в обоих наборах одновременно:{set(in_two)}")
    print(f"Числа из первого набора, которые отсутствуют во втором:{set(in_first)}")
    print(f"Числа из второго набора, которые отсутствуют в первом:{set(in_second)}")
    print(f"Числа из обоих наборов, за исключением чисел, найденных в пункте 1:{set(origin)}")
except:
    print("Вы неправильно ввели списки!")