# Создайте программу-калькулятор, которая запрашивает у пользователя два
# числа a и b и выполняет базовые операции (сумма a и b, разность a и b,
# произведение a и b, частное от деления a на b, остаток от деления a на b,
# результат возведения числа a в степень b) и корректно обрабатывает деление
# на ноль

a=int(input("Введите первое число:"))
b=int(input("Введите второе число:"))
print("Сумма: " , a+b)
print("Разность: " , a-b)
print("Произведение: " , a*b)
print("Возведение в степень: " , a**b)
print("Остаток от деления: " , a%b)
try:
    print("Частное: " , a/b)
except ZeroDivisionError:
    print("Деление на ноль запрещено!")