# Тарифный план мобильной связи включает в себя 60 минут разговоров, 30 смс-
# сообщений, 1ГБ интернет-трафика за 24,99 руб. в месяц. Каждая
# дополнительная минута стоит 0,89 руб., каждое дополнительное сообщение –
# 0,59 руб., каждый дополнительный Мб – 0,79 руб. Общая сумма облагается
# налогом в размере 2%.
# Напишите программу, которая будет запрашивать у пользователя количество
# израсходованных за месяц минут разговора, смс-сообщений, интернет-
# трафика и отображать базовую сумму тарификации, сумму за дополнительные
# сообщения, минуты, интернет-трафик, налог, а также итоговую сумму к
# оплате. При этом дополнительные услуги необходимо выводить на экран
# только в случае их расходования. Убедитесь в том, что все сумму
# отображаются в формате с двумя знаками после запятой.

print("--- Расчет стоимости мобильной связи ---")


minutes = float(input("Введите количество израсходованных минут: "))
sms = int(input("Введите количество израсходованных SMS: "))
mb = float(input("Введите количество израсходованных Мб интернет-трафика: "))

base_price = 24.99


extra_minutes_price = 0.0
extra_sms_price = 0.0
extra_mb_price = 0.0


if minutes > 60:
    extra_minutes = minutes - 60
    extra_minutes_price = extra_minutes * 0.89


if sms > 30:
    extra_sms = sms - 30
    extra_sms_price = extra_sms * 0.59


if mb > 1024:
    extra_mb = mb - 1024
    extra_mb_price = extra_mb * 0.79


subtotal = base_price + extra_minutes_price + extra_sms_price + extra_mb_price

total = subtotal + subtotal * 0.02


print()
print("--- Детализация счета ---")
print("Базовая стоимость тарифа:", round(base_price, 2), "руб.")


if extra_minutes_price > 0:
    print("Плата за дополнительные минуты:", round(extra_minutes_price, 2), "руб.")

if extra_sms_price > 0:
    print("Плата за дополнительные SMS:", round(extra_sms_price, 2), "руб.")

if extra_mb_price > 0:
    print("Плата за дополнительный интернет:", round(extra_mb_price, 2), "руб.")


print("Налог (2%):", round(subtotal*0.02, 2), "руб.")
print("Итоговая сумма к оплате:", round(total, 2), "руб.")
